app/controllers/areas_controller.rb

SELECT * FROM "areas" ORDER BY lft ASC LIMIT 20 OFFSET 0
SELECT count(*) AS count_all FROM "areas"
---
  def index
    @areas = Area.paginate(:page => @page)

SELECT * FROM "areas" WHERE ("areas"."id" = 6)
---
  def show
    @area = Area.find(params[:id])

SELECT * FROM "areas" WHERE ("areas"."id" = 1)
---
  def edit
    @area = Area.find(params[:id])

SELECT * FROM "areas" WHERE ("areas"."id" = 1)
UPDATE "areas" SET "updated_at" = '2009-07-09 16:23:02', "tipo_id" = 1, "nivel_id" = 1 WHERE "id" = 1
---
  def update
    @area = Area.find(params[:id])

    respond_to do |format|
      if @area.update_attributes(params[:area])

SELECT * FROM "areas" WHERE ("areas"."activo" = 't') AND (1 = 1 AND (areas.lft BETWEEN 1 AND 70)) ORDER BY areas.lft
SELECT * FROM "tipos" WHERE ("tipos"."id" = 1)
---
  def seleccionar
   @area = Area.find(params[:id], :conditions => {:activo => true}, :include => [:nivel, :tipo])