app/controllers/formularios_controller.rb

  def index
    @formularios = Formulario.paginate(:page => @page)
---
SELECT * FROM "formularios" LIMIT 20 OFFSET 0

  def show
    @formulario = Formulario.find(params[:id], :include => {:area => [:tipo, :nivel]})
---
SELECT * FROM "areas" WHERE ("areas"."id" = 2) ORDER BY lft ASC
SELECT * FROM "formularios" WHERE ("formularios"."id" = 1)
SELECT * FROM "tipos" WHERE ("tipos"."id" = 1)

  def edit
    @formulario = Formulario.find(params[:id])
---
SELECT * FROM "formularios" WHERE ("formularios"."id" = 8)

  def create
    @formulario = Formulario.new(params[:formulario])

    respond_to do |format|
      if @formulario.save
---
INSERT INTO "formularios" ("descripcion_funciones_especificas", "fecha_aprovacion", "created_at", "areas_dependientes", "nombre", "usuario_id", "descripcion_funcion_principal", "updated_at", "area_id", "relaciones_coordinacion_interna", "inmediato_superior", "objectivo_area_funcional", "relacionamiento_interinstitucional", "fecha_actualizacion", "ci", "cargo", "tipo_area", "principales_resultados", "apellido", "nivel_jerarquico") VALUES('Masajes al Big Boss', NULL, '2009-07-22 15:25:30', 'Minesterio ', 'Ana', NULL, 'Llenado de planillas y cafecitos', '2009-07-22 15:25:30', NULL, 'Ninguna', 'Recursos Humanos', 'preaparacionde de documentos

  def update
    @formulario = Formulario.find(params[:id])

    respond_to do |format|
      if @formulario.update_attributes(params[:formulario])
---
SELECT * FROM "formularios" WHERE ("formularios"."id" = 8)
UPDATE "formularios" SET "updated_at" = '2009-07-22 19:47:39', "inmediato_superior" = '', "areas_dependientes" = '', "tipo_area" = '', "nombre" = '', "apellido" = '', "nivel_jerarquico" = '', "ci" = '3376951', "descripcion_funciones_especificas" = '1. Coordinar la elaboración y/o reformulación de los Planes Sectoriales de Desarrollo de los sectores de Hidrocarburos y Electricidad con los Viceministerios, Direcciones Generales e Instituciones bajo tuición o dependencia orgánica y administrativa del MHE, articulado al Plan Nacional de Desarrollo PND.

  def print
    @formulario = Formulario.find(params[:id])
---
SELECT * FROM "formularios" WHERE ("formularios"."id" = 9)

  def busqueda
    @formulario = Formulario.first(:conditions => ['ci = ?', params[:search]])
---
SELECT * FROM "formularios" WHERE (ci = '6098494') LIMIT 1