app/controllers/tipos_controller.rb

SELECT * FROM "tipos"
---
  def index
    @tipos = Tipo.all.paginate(:page => @page)

SELECT * FROM "tipos" WHERE ("tipos"."id" = 1)
---
  def show
    @tipo = Tipo.find(params[:id])

INSERT INTO "tipos" ("created_at", "nombre", "updated_at") VALUES('2009-07-09 15:53:30', 'Sustantiva', '2009-07-09 15:53:30')
---
  def create
    @tipo = Tipo.new(params[:tipo])

    respond_to do |format|
      if @tipo.save