app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO "users" ("name", "salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES('', 'b2175775a3a74b7c66a28c949c92e89c90d77221', '2009-07-17 20:49:48', '08a5c6e2d8bf0c43493af980d3408438c706c0f0', NULL, '2009-07-17 20:49:48', NULL, 'carakan', 'gotama@gmail.com')